[
  {
    "title": "ERROR_USER_PROFILE_LOAD",
    "code": 500,
    "msg": "User profile cannot be loaded."
  },
  {
    "title": "ERROR_ARITHMETIC_OVERFLOW",
    "code": 534,
    "msg": "Arithmetic result exceeded 32 bits."
  },
  {
    "title": "ERROR_PIPE_CONNECTED",
    "code": 535,
    "msg": "There is a process on other end of the pipe."
  },
  {
    "title": "ERROR_PIPE_LISTENING",
    "code": 536,
    "msg": "Waiting for a process to open the other end of the pipe."
  },
  {
    "title": "ERROR_VERIFIER_STOP",
    "code": 537,
    "msg": "Application verifier has found an error in the current process."
  },
  {
    "title": "ERROR_ABIOS_ERROR",
    "code": 538,
    "msg": "An error occurred in the ABIOS subsystem."
  },
  {
    "title": "ERROR_WX86_WARNING",
    "code": 539,
    "msg": "A warning occurred in the WX86 subsystem."
  },
  {
    "title": "ERROR_WX86_ERROR",
    "code": 540,
    "msg": "An error occurred in the WX86 subsystem."
  },
  {
    "title": "ERROR_TIMER_NOT_CANCELED",
    "code": 541,
    "msg": "An attempt was made to cancel or set a timer that has an associated APC and the subject thread is not the thread that originally set the timer with an associated APC routine."
  },
  {
    "title": "ERROR_UNWIND",
    "code": 542,
    "msg": "Unwind exception code."
  },
  {
    "title": "ERROR_BAD_STACK",
    "code": 543,
    "msg": "An invalid or unaligned stack was encountered during an unwind operation."
  },
  {
    "title": "ERROR_INVALID_UNWIND_TARGET",
    "code": 544,
    "msg": "An invalid unwind target was encountered during an unwind operation."
  },
  {
    "title": "ERROR_INVALID_PORT_ATTRIBUTES",
    "code": 545,
    "msg": "Invalid Object Attributes specified to NtCreatePort or invalid Port Attributes specified to NtConnectPort"
  },
  {
    "title": "ERROR_PORT_MESSAGE_TOO_LONG",
    "code": 546,
    "msg": "Length of message passed to NtRequestPort or NtRequestWaitReplyPort was longer than the maximum message allowed by the port."
  },
  {
    "title": "ERROR_INVALID_QUOTA_LOWER",
    "code": 547,
    "msg": "An attempt was made to lower a quota limit below the current usage."
  },
  {
    "title": "ERROR_DEVICE_ALREADY_ATTACHED",
    "code": 548,
    "msg": "An attempt was made to attach to a device that was already attached to another device."
  },
  {
    "title": "ERROR_INSTRUCTION_MISALIGNMENT",
    "code": 549,
    "msg": "An attempt was made to execute an instruction at an unaligned address and the host system does not support unaligned instruction references."
  },
  {
    "title": "ERROR_PROFILING_NOT_STARTED",
    "code": 550,
    "msg": "Profiling not started."
  },
  {
    "title": "ERROR_PROFILING_NOT_STOPPED",
    "code": 551,
    "msg": "Profiling not stopped."
  },
  {
    "title": "ERROR_COULD_NOT_INTERPRET",
    "code": 552,
    "msg": "The passed ACL did not contain the minimum required information."
  },
  {
    "title": "ERROR_PROFILING_AT_LIMIT",
    "code": 553,
    "msg": "The number of active profiling objects is at the maximum and no more may be started."
  },
  {
    "title": "ERROR_CANT_WAIT",
    "code": 554,
    "msg": "Used to indicate that an operation cannot continue without blocking for I/O."
  },
  {
    "title": "ERROR_CANT_TERMINATE_SELF",
    "code": 555,
    "msg": "Indicates that a thread attempted to terminate itself by default (called NtTerminateThread with ) and it was the last thread in the current process."
  },
  {
    "title": "ERROR_UNEXPECTED_MM_CREATE_ERR",
    "code": 556,
    "msg": "If an MM error is returned which is not defined in the standard FsRtl filter, it is converted to one of the following errors which is guaranteed to be in the filter. In this case information is lost, however, the filter correctly handles the exception."
  },
  {
    "title": "ERROR_UNEXPECTED_MM_MAP_ERROR",
    "code": 557,
    "msg": "If an MM error is returned which is not defined in the standard FsRtl filter, it is converted to one of the following errors which is guaranteed to be in the filter. In this case information is lost, however, the filter correctly handles the exception."
  },
  {
    "title": "ERROR_UNEXPECTED_MM_EXTEND_ERR",
    "code": 558,
    "msg": "If an MM error is returned which is not defined in the standard FsRtl filter, it is converted to one of the following errors which is guaranteed to be in the filter. In this case information is lost, however, the filter correctly handles the exception."
  },
  {
    "title": "ERROR_BAD_FUNCTION_TABLE",
    "code": 559,
    "msg": "A malformed function table was encountered during an unwind operation."
  },
  {
    "title": "ERROR_NO_GUID_TRANSLATION",
    "code": 560,
    "msg": "Indicates that an attempt was made to assign protection to a file system file or directory and one of the SIDs in the security descriptor could not be translated into a GUID that could be stored by the file system. This causes the protection attempt to fail, which may cause a file creation attempt to fail."
  },
  {
    "title": "ERROR_INVALID_LDT_SIZE",
    "code": 561,
    "msg": "Indicates that an attempt was made to grow an LDT by setting its size, or that the size was not an even number of selectors."
  },
  {
    "title": "ERROR_INVALID_LDT_OFFSET",
    "code": 563,
    "msg": "Indicates that the starting value for the LDT information was not an integral multiple of the selector size."
  },
  {
    "title": "ERROR_INVALID_LDT_DESCRIPTOR",
    "code": 564,
    "msg": "Indicates that the user supplied an invalid descriptor when trying to set up Ldt descriptors."
  },
  {
    "title": "ERROR_TOO_MANY_THREADS",
    "code": 565,
    "msg": "Indicates a process has too many threads to perform the requested action. For example, assignment of a primary token may only be performed when a process has zero or one threads."
  },
  {
    "title": "ERROR_THREAD_NOT_IN_PROCESS",
    "code": 566,
    "msg": "An attempt was made to operate on a thread within a specific process, but the thread specified is not in the process specified."
  },
  {
    "title": "ERROR_PAGEFILE_QUOTA_EXCEEDED",
    "code": 567,
    "msg": "Page file quota was exceeded."
  },
  {
    "title": "ERROR_LOGON_SERVER_CONFLICT",
    "code": 568,
    "msg": "The Netlogon service cannot start because another Netlogon service running in the domain conflicts with the specified role."
  },
  {
    "title": "ERROR_SYNCHRONIZATION_REQUIRED",
    "code": 569,
    "msg": "The SAM database on a Windows Server is significantly out of synchronization with the copy on the Domain Controller. A complete synchronization is required."
  },
  {
    "title": "ERROR_NET_OPEN_FAILED",
    "code": 570,
    "msg": "The NtCreateFile API failed. This error should never be returned to an application, it is a place holder for the Windows Lan Manager Redirector to use in its internal error mapping routines."
  },
  {
    "title": "ERROR_IO_PRIVILEGE_FAILED",
    "code": 571,
    "msg": "{Privilege Failed} The I/O permissions for the process could not be changed."
  },
  {
    "title": "ERROR_CONTROL_C_EXIT",
    "code": 572,
    "msg": "{Application Exit by CTRL+C} The application terminated as a result of a CTRL+C."
  },
  {
    "title": "ERROR_MISSING_SYSTEMFILE",
    "code": 573,
    "msg": "{Missing System File} The required system file %hs is bad or missing."
  },
  {
    "title": "ERROR_UNHANDLED_EXCEPTION",
    "code": 574,
    "msg": "{Application Error} The exception %s (0x%08lx) occurred in the application at location 0x%08lx."
  },
  {
    "title": "ERROR_APP_INIT_FAILURE",
    "code": 575,
    "msg": "{Application Error} The application was unable to start correctly (0x%lx). Click OK to close the application."
  },
  {
    "title": "ERROR_PAGEFILE_CREATE_FAILED",
    "code": 576,
    "msg": "{Unable to Create Paging File} The creation of the paging file %hs failed (%lx). The requested size was %ld."
  },
  {
    "title": "ERROR_INVALID_IMAGE_HASH",
    "code": 577,
    "msg": "Windows cannot verify the digital signature for this file. A recent hardware or software change might have installed a file that is signed incorrectly or damaged, or that might be malicious software from an unknown source."
  },
  {
    "title": "ERROR_NO_PAGEFILE",
    "code": 578,
    "msg": "{No Paging File Specified} No paging file was specified in the system configuration."
  },
  {
    "title": "ERROR_ILLEGAL_FLOAT_CONTEXT",
    "code": 579,
    "msg": "{EXCEPTION} A real-mode application issued a floating-point instruction and floating-point hardware is not present."
  },
  {
    "title": "ERROR_NO_EVENT_PAIR",
    "code": 580,
    "msg": "An event pair synchronization operation was performed using the thread specific client/server event pair object, but no event pair object was associated with the thread."
  },
  {
    "title": "ERROR_DOMAIN_CTRLR_CONFIG_ERROR",
    "code": 581,
    "msg": "A Windows Server has an incorrect configuration."
  },
  {
    "title": "ERROR_ILLEGAL_CHARACTER",
    "code": 582,
    "msg": "An illegal character was encountered. For a multi-byte character set this includes a lead byte without a succeeding trail byte. For the Unicode character set this includes the characters 0xFFFF and 0xFFFE."
  },
  {
    "title": "ERROR_UNDEFINED_CHARACTER",
    "code": 583,
    "msg": "The Unicode character is not defined in the Unicode character set installed on the system."
  },
  {
    "title": "ERROR_FLOPPY_VOLUME",
    "code": 584,
    "msg": "The paging file cannot be created on a floppy diskette."
  },
  {
    "title": "ERROR_BIOS_FAILED_TO_CONNECT_INTERRUPT",
    "code": 585,
    "msg": "The system BIOS failed to connect a system interrupt to the device or bus for which the device is connected."
  },
  {
    "title": "ERROR_BACKUP_CONTROLLER",
    "code": 586,
    "msg": "This operation is only allowed for the Primary Domain Controller of the domain."
  },
  {
    "title": "ERROR_MUTANT_LIMIT_EXCEEDED",
    "code": 587,
    "msg": "An attempt was made to acquire a mutant such that its maximum count would have been exceeded."
  },
  {
    "title": "ERROR_FS_DRIVER_REQUIRED",
    "code": 588,
    "msg": "A volume has been accessed for which a file system driver is required that has not yet been loaded."
  },
  {
    "title": "ERROR_CANNOT_LOAD_REGISTRY_FILE",
    "code": 589,
    "msg": "{Registry File Failure} The registry cannot load the hive (file): %hs or its log or alternate. It is corrupt, absent, or not writable."
  },
  {
    "title": "ERROR_DEBUG_ATTACH_FAILED",
    "code": 590,
    "msg": "{Unexpected Failure in } An unexpected failure occurred while processing a API request. You may choose OK to terminate the process, or Cancel to ignore the error."
  },
  {
    "title": "ERROR_SYSTEM_PROCESS_TERMINATED",
    "code": 591,
    "msg": "{Fatal System Error} The %hs system process terminated unexpectedly with a status of 0x%08x (0x%08x 0x%08x). The system has been shut down."
  },
  {
    "title": "ERROR_DATA_NOT_ACCEPTED",
    "code": 592,
    "msg": "{Data Not Accepted} The TDI client could not handle the data received during an indication."
  },
  {
    "title": "ERROR_VDM_HARD_ERROR",
    "code": 593,
    "msg": "NTVDM encountered a hard error."
  },
  {
    "title": "ERROR_DRIVER_CANCEL_TIMEOUT",
    "code": 594,
    "msg": "{Cancel Timeout} The driver %hs failed to complete a cancelled I/O request in the allotted time."
  },
  {
    "title": "ERROR_REPLY_MESSAGE_MISMATCH",
    "code": 595,
    "msg": "{Reply Message Mismatch} An attempt was made to reply to an LPC message, but the thread specified by the client ID in the message was not waiting on that message."
  },
  {
    "title": "ERROR_LOST_WRITEBEHIND_DATA",
    "code": 596,
    "msg": "{Delayed Write Failed} Windows was unable to save all the data for the file %hs. The data has been lost. This error may be caused by a failure of your computer hardware or network connection. Please try to save this file elsewhere."
  },
  {
    "title": "ERROR_CLIENT_SERVER_PARAMETERS_INVALID",
    "code": 597,
    "msg": "The parameter(s) passed to the server in the client/server shared memory window were invalid. Too much data may have been put in the shared memory window."
  },
  {
    "title": "ERROR_NOT_TINY_STREAM",
    "code": 598,
    "msg": "The stream is not a tiny stream."
  },
  {
    "title": "ERROR_STACK_OVERFLOW_READ",
    "code": 599,
    "msg": "The request must be handled by the stack overflow code."
  },
  {
    "title": "ERROR_CONVERT_TO_LARGE",
    "code": 600,
    "msg": "Internal OFS status codes indicating how an allocation operation is handled. Either it is retried after the containing onode is moved or the extent stream is converted to a large stream."
  },
  {
    "title": "ERROR_FOUND_OUT_OF_SCOPE",
    "code": 601,
    "msg": "The attempt to find the object found an object matching by ID on the volume but it is out of the scope of the handle used for the operation."
  },
  {
    "title": "ERROR_ALLOCATE_BUCKET",
    "code": 602,
    "msg": "The bucket array must be grown. Retry transaction after doing so."
  },
  {
    "title": "ERROR_MARSHALL_OVERFLOW",
    "code": 603,
    "msg": "The user/kernel marshalling buffer has overflowed."
  },
  {
    "title": "ERROR_INVALID_VARIANT",
    "code": 604,
    "msg": "The supplied variant structure contains invalid data."
  },
  {
    "title": "ERROR_BAD_COMPRESSION_BUFFER",
    "code": 605,
    "msg": "The specified buffer contains ill-formed data."
  },
  {
    "title": "ERROR_AUDIT_FAILED",
    "code": 606,
    "msg": "{Audit Failed} An attempt to generate a security audit failed."
  },
  {
    "title": "ERROR_TIMER_RESOLUTION_NOT_SET",
    "code": 607,
    "msg": "The timer resolution was not previously set by the current process."
  },
  {
    "title": "ERROR_INSUFFICIENT_LOGON_INFO",
    "code": 608,
    "msg": "There is insufficient account information to log you on."
  },
  {
    "title": "ERROR_BAD_DLL_ENTRYPOINT",
    "code": 609,
    "msg": "{Invalid DLL Entrypoint} The dynamic link library %hs is not written correctly. The stack pointer has been left in an inconsistent state. The entrypoint should be declared as WINAPI or STDCALL. Select YES to fail the DLL load. Select NO to continue execution. Selecting NO may cause the application to operate incorrectly."
  },
  {
    "title": "ERROR_BAD_SERVICE_ENTRYPOINT",
    "code": 610,
    "msg": "{Invalid Service Callback Entrypoint} The %hs service is not written correctly. The stack pointer has been left in an inconsistent state. The callback entrypoint should be declared as WINAPI or STDCALL. Selecting OK will cause the service to continue operation. However, the service process may operate incorrectly."
  },
  {
    "title": "ERROR_IP_ADDRESS_CONFLICT1",
    "code": 611,
    "msg": "There is an IP address conflict with another system on the network."
  },
  {
    "title": "ERROR_IP_ADDRESS_CONFLICT2",
    "code": 612,
    "msg": "There is an IP address conflict with another system on the network."
  },
  {
    "title": "ERROR_REGISTRY_QUOTA_LIMIT",
    "code": 613,
    "msg": "{Low On Registry Space} The system has reached the maximum size allowed for the system part of the registry. Additional storage requests will be ignored."
  },
  {
    "title": "ERROR_NO_CALLBACK_ACTIVE",
    "code": 614,
    "msg": "A callback return system service cannot be executed when no callback is active."
  },
  {
    "title": "ERROR_PWD_TOO_SHORT",
    "code": 615,
    "msg": "The password provided is too short to meet the policy of your user account. Please choose a longer password."
  },
  {
    "title": "ERROR_PWD_TOO_RECENT",
    "code": 616,
    "msg": "The policy of your user account does not allow you to change passwords too frequently. This is done to prevent users from changing back to a familiar, but potentially discovered, password. If you feel your password has been compromised then please contact your administrator immediately to have a new one assigned."
  },
  {
    "title": "ERROR_PWD_HISTORY_CONFLICT",
    "code": 617,
    "msg": "You have attempted to change your password to one that you have used in the past. The policy of your user account does not allow this. Please select a password that you have not previously used."
  },
  {
    "title": "ERROR_UNSUPPORTED_COMPRESSION",
    "code": 618,
    "msg": "The specified compression format is unsupported."
  },
  {
    "title": "ERROR_INVALID_HW_PROFILE",
    "code": 619,
    "msg": "The specified hardware profile configuration is invalid."
  },
  {
    "title": "ERROR_INVALID_PLUGPLAY_DEVICE_PATH",
    "code": 620,
    "msg": "The specified Plug and Play registry device path is invalid."
  },
  {
    "title": "ERROR_QUOTA_LIST_INCONSISTENT",
    "code": 621,
    "msg": "The specified quota list is internally inconsistent with its descriptor."
  },
  {
    "title": "ERROR_EVALUATION_EXPIRATION",
    "code": 622,
    "msg": "{Windows Evaluation Notification} The evaluation period for this installation of Windows has expired. This system will shutdown in 1 hour. To restore access to this installation of Windows, please upgrade this installation using a licensed distribution of this product."
  },
  {
    "title": "ERROR_ILLEGAL_DLL_RELOCATION",
    "code": 623,
    "msg": "{Illegal System DLL Relocation} The system DLL %hs was relocated in memory. The application will not run properly. The relocation occurred because the DLL %hs occupied an address range reserved for Windows system DLLs. The vendor supplying the DLL should be contacted for a new DLL."
  },
  {
    "title": "ERROR_DLL_INIT_FAILED_LOGOFF",
    "code": 624,
    "msg": "{DLL Initialization Failed} The application failed to initialize because the window station is shutting down."
  },
  {
    "title": "ERROR_VALIDATE_CONTINUE",
    "code": 625,
    "msg": "The validation process needs to continue on to the next step."
  },
  {
    "title": "ERROR_NO_MORE_MATCHES",
    "code": 626,
    "msg": "There are no more matches for the current index enumeration."
  },
  {
    "title": "ERROR_RANGE_LIST_CONFLICT",
    "code": 627,
    "msg": "The range could not be added to the range list because of a conflict."
  },
  {
    "title": "ERROR_SERVER_SID_MISMATCH",
    "code": 628,
    "msg": "The server process is running under a SID different than that required by client."
  },
  {
    "title": "ERROR_CANT_ENABLE_DENY_ONLY",
    "code": 629,
    "msg": "A group marked use for deny only cannot be enabled."
  },
  {
    "title": "ERROR_FLOAT_MULTIPLE_FAULTS",
    "code": 630,
    "msg": "{EXCEPTION} Multiple floating point faults."
  },
  {
    "title": "ERROR_FLOAT_MULTIPLE_TRAPS",
    "code": 631,
    "msg": "{EXCEPTION} Multiple floating point traps."
  },
  {
    "title": "ERROR_NOINTERFACE",
    "code": 632,
    "msg": "The requested interface is not supported."
  },
  {
    "title": "ERROR_DRIVER_FAILED_SLEEP",
    "code": 633,
    "msg": "{System Standby Failed} The driver %hs does not support standby mode. Updating this driver may allow the system to go to standby mode."
  },
  {
    "title": "ERROR_CORRUPT_SYSTEM_FILE",
    "code": 634,
    "msg": "The system file %1 has become corrupt and has been replaced."
  },
  {
    "title": "ERROR_COMMITMENT_MINIMUM",
    "code": 635,
    "msg": "{Virtual Memory Minimum Too Low} Your system is low on virtual memory. Windows is increasing the size of your virtual memory paging file. During this process, memory requests for some applications may be denied. For more information, see Help."
  },
  {
    "title": "ERROR_PNP_RESTART_ENUMERATION",
    "code": 636,
    "msg": "A device was removed so enumeration must be restarted."
  },
  {
    "title": "ERROR_SYSTEM_IMAGE_BAD_SIGNATURE",
    "code": 637,
    "msg": "{Fatal System Error} The system image %s is not properly signed. The file has been replaced with the signed file. The system has been shut down."
  },
  {
    "title": "ERROR_PNP_REBOOT_REQUIRED",
    "code": 638,
    "msg": "Device will not start without a reboot."
  },
  {
    "title": "ERROR_INSUFFICIENT_POWER",
    "code": 639,
    "msg": "There is not enough power to complete the requested operation."
  },
  {
    "title": "ERROR_MULTIPLE_FAULT_VIOLATION",
    "code": 640,
    "msg": "ERROR_MULTIPLE_FAULT_VIOLATION"
  },
  {
    "title": "ERROR_SYSTEM_SHUTDOWN",
    "code": 641,
    "msg": "The system is in the process of shutting down."
  },
  {
    "title": "ERROR_PORT_NOT_SET",
    "code": 642,
    "msg": "An attempt to remove a processes DebugPort was made, but a port was not already associated with the process."
  },
  {
    "title": "ERROR_DS_VERSION_CHECK_FAILURE",
    "code": 643,
    "msg": "This version of Windows is not compatible with the behavior version of directory forest, domain or domain controller."
  },
  {
    "title": "ERROR_RANGE_NOT_FOUND",
    "code": 644,
    "msg": "The specified range could not be found in the range list."
  },
  {
    "title": "ERROR_NOT_SAFE_MODE_DRIVER",
    "code": 646,
    "msg": "The driver was not loaded because the system is booting into safe mode."
  },
  {
    "title": "ERROR_FAILED_DRIVER_ENTRY",
    "code": 647,
    "msg": "The driver was not loaded because it failed its initialization call."
  },
  {
    "title": "ERROR_DEVICE_ENUMERATION_ERROR",
    "code": 648,
    "msg": "The &#34;%hs&#34; encountered an error while applying power or reading the device configuration. This may be caused by a failure of your hardware or by a poor connection."
  },
  {
    "title": "ERROR_MOUNT_POINT_NOT_RESOLVED",
    "code": 649,
    "msg": "The create operation failed because the name contained at least one mount point which resolves to a volume to which the specified device object is not attached."
  },
  {
    "title": "ERROR_INVALID_DEVICE_OBJECT_PARAMETER",
    "code": 650,
    "msg": "The device object parameter is either not a valid device object or is not attached to the volume specified by the file name."
  },
  {
    "title": "ERROR_MCA_OCCURED",
    "code": 651,
    "msg": "A Machine Check Error has occurred. Please check the system eventlog for additional information."
  },
  {
    "title": "ERROR_DRIVER_DATABASE_ERROR",
    "code": 652,
    "msg": "There was error [%2] processing the driver database."
  },
  {
    "title": "ERROR_SYSTEM_HIVE_TOO_LARGE",
    "code": 653,
    "msg": "System hive size has exceeded its limit."
  },
  {
    "title": "ERROR_DRIVER_FAILED_PRIOR_UNLOAD",
    "code": 654,
    "msg": "The driver could not be loaded because a previous version of the driver is still in memory."
  },
  {
    "title": "ERROR_VOLSNAP_PREPARE_HIBERNATE",
    "code": 655,
    "msg": "{Volume Shadow Copy Service} Please wait while the Volume Shadow Copy Service prepares volume %hs for hibernation."
  },
  {
    "title": "ERROR_HIBERNATION_FAILURE",
    "code": 656,
    "msg": "The system has failed to hibernate (The error code is %hs). Hibernation will be disabled until the system is restarted."
  },
  {
    "title": "ERROR_PWD_TOO_LONG",
    "code": 657,
    "msg": "The password provided is too long to meet the policy of your user account. Please choose a shorter password."
  },
  {
    "title": "ERROR_FILE_SYSTEM_LIMITATION",
    "code": 665,
    "msg": "The requested operation could not be completed due to a file system limitation."
  },
  {
    "title": "ERROR_ASSERTION_FAILURE",
    "code": 668,
    "msg": "An assertion failure has occurred."
  },
  {
    "title": "ERROR_ACPI_ERROR",
    "code": 669,
    "msg": "An error occurred in the ACPI subsystem."
  },
  {
    "title": "ERROR_WOW_ASSERTION",
    "code": 670,
    "msg": "WOW Assertion Error."
  },
  {
    "title": "ERROR_PNP_BAD_MPS_TABLE",
    "code": 671,
    "msg": "A device is missing in the system BIOS MPS table. This device will not be used. Please contact your system vendor for system BIOS update."
  },
  {
    "title": "ERROR_PNP_TRANSLATION_FAILED",
    "code": 672,
    "msg": "A translator failed to translate resources."
  },
  {
    "title": "ERROR_PNP_IRQ_TRANSLATION_FAILED",
    "code": 673,
    "msg": "A IRQ translator failed to translate resources."
  },
  {
    "title": "ERROR_PNP_INVALID_ID",
    "code": 674,
    "msg": "Driver %2 returned invalid ID for a child device (%3)."
  },
  {
    "title": "ERROR_WAKE_SYSTEM_DEBUGGER",
    "code": 675,
    "msg": "{Kernel Debugger Awakened} the system debugger was awakened by an interrupt."
  },
  {
    "title": "ERROR_HANDLES_CLOSED",
    "code": 676,
    "msg": "{Handles Closed} Handles to objects have been automatically closed as a result of the requested operation."
  },
  {
    "title": "ERROR_EXTRANEOUS_INFORMATION",
    "code": 677,
    "msg": "{Too Much Information} The specified access control list (ACL) contained more information than was expected."
  },
  {
    "title": "ERROR_RXACT_COMMIT_NECESSARY",
    "code": 678,
    "msg": "This warning level status indicates that the transaction state already exists for the registry sub-tree, but that a transaction commit was previously aborted. The commit has NOT been completed, but has not been rolled back either (so it may still be committed if desired)."
  },
  {
    "title": "ERROR_MEDIA_CHECK",
    "code": 679,
    "msg": "{Media Changed} The media may have changed."
  },
  {
    "title": "ERROR_GUID_SUBSTITUTION_MADE",
    "code": 680,
    "msg": "{GUID Substitution} During the translation of a global identifier (GUID) to a Windows security ID (SID), no administratively-defined GUID prefix was found. A substitute prefix was used, which will not compromise system security. However, this may provide a more restrictive access than intended."
  },
  {
    "title": "ERROR_STOPPED_ON_SYMLINK",
    "code": 681,
    "msg": "The create operation stopped after reaching a symbolic link."
  },
  {
    "title": "ERROR_LONGJUMP",
    "code": 682,
    "msg": "A long jump has been executed."
  },
  {
    "title": "ERROR_PLUGPLAY_QUERY_VETOED",
    "code": 683,
    "msg": "The Plug and Play query operation was not successful."
  },
  {
    "title": "ERROR_UNWIND_CONSOLIDATE",
    "code": 684,
    "msg": "A frame consolidation has been executed."
  },
  {
    "title": "ERROR_REGISTRY_HIVE_RECOVERED",
    "code": 685,
    "msg": "{Registry Hive Recovered} Registry hive (file): %hs was corrupted and it has been recovered. Some data might have been lost."
  },
  {
    "title": "ERROR_DLL_MIGHT_BE_INSECURE",
    "code": 686,
    "msg": "The application is attempting to run executable code from the module %hs. This may be insecure. An alternative, %hs, is available. Should the application use the secure module %hs?"
  },
  {
    "title": "ERROR_DLL_MIGHT_BE_INCOMPATIBLE",
    "code": 687,
    "msg": "The application is loading executable code from the module %hs. This is secure, but may be incompatible with previous releases of the operating system. An alternative, %hs, is available. Should the application use the secure module %hs?"
  },
  {
    "title": "ERROR_DBG_EXCEPTION_NOT_HANDLED",
    "code": 688,
    "msg": "Debugger did not handle the exception."
  },
  {
    "title": "ERROR_DBG_REPLY_LATER",
    "code": 689,
    "msg": "Debugger will reply later."
  },
  {
    "title": "ERROR_DBG_UNABLE_TO_PROVIDE_HANDLE",
    "code": 690,
    "msg": "Debugger cannot provide handle."
  },
  {
    "title": "ERROR_DBG_TERMINATE_THREAD",
    "code": 691,
    "msg": "Debugger terminated thread."
  },
  {
    "title": "ERROR_DBG_TERMINATE_PROCESS",
    "code": 692,
    "msg": "Debugger terminated process."
  },
  {
    "title": "ERROR_DBG_CONTROL_C",
    "code": 693,
    "msg": "Debugger got control C."
  },
  {
    "title": "ERROR_DBG_PRINTEXCEPTION_C",
    "code": 694,
    "msg": "Debugger printed exception on control C."
  },
  {
    "title": "ERROR_DBG_RIPEXCEPTION",
    "code": 695,
    "msg": "Debugger received RIP exception."
  },
  {
    "title": "ERROR_DBG_CONTROL_BREAK",
    "code": 696,
    "msg": "Debugger received control break."
  },
  {
    "title": "ERROR_DBG_COMMAND_EXCEPTION",
    "code": 697,
    "msg": "Debugger command communication exception."
  },
  {
    "title": "ERROR_OBJECT_NAME_EXISTS",
    "code": 698,
    "msg": "{Object Exists} An attempt was made to create an object and the object name already existed."
  },
  {
    "title": "ERROR_THREAD_WAS_SUSPENDED",
    "code": 699,
    "msg": "{Thread Suspended} A thread termination occurred while the thread was suspended. The thread was resumed, and termination proceeded."
  },
  {
    "title": "ERROR_IMAGE_NOT_AT_BASE",
    "code": 700,
    "msg": "{Image Relocated} An image file could not be mapped at the address specified in the image file. Local fixups must be performed on this image."
  },
  {
    "title": "ERROR_RXACT_STATE_CREATED",
    "code": 701,
    "msg": "This informational level status indicates that a specified registry sub-tree transaction state did not yet exist and had to be created."
  },
  {
    "title": "ERROR_SEGMENT_NOTIFICATION",
    "code": 702,
    "msg": "{Segment Load} A virtual DOS machine (VDM) is loading, unloading, or moving an MS-DOS or Win16 program segment image. An exception is raised so a debugger can load, unload or track symbols and breakpoints within these 16-bit segments."
  },
  {
    "title": "ERROR_BAD_CURRENT_DIRECTORY",
    "code": 703,
    "msg": "{Invalid Current Directory} The process cannot switch to the startup current directory %hs. Select OK to set current directory to %hs, or select CANCEL to exit."
  },
  {
    "title": "ERROR_FT_READ_RECOVERY_FROM_BACKUP",
    "code": 704,
    "msg": "{Redundant Read} To satisfy a read request, the NT fault-tolerant file system successfully read the requested data from a redundant copy. This was done because the file system encountered a failure on a member of the fault-tolerant volume, but was unable to reassign the failing area of the device."
  },
  {
    "title": "ERROR_FT_WRITE_RECOVERY",
    "code": 705,
    "msg": "{Redundant Write} To satisfy a write request, the NT fault-tolerant file system successfully wrote a redundant copy of the information. This was done because the file system encountered a failure on a member of the fault-tolerant volume, but was not able to reassign the failing area of the device."
  },
  {
    "title": "ERROR_IMAGE_MACHINE_TYPE_MISMATCH",
    "code": 706,
    "msg": "{Machine Type Mismatch} The image file %hs is valid, but is for a machine type other than the current machine. Select OK to continue, or CANCEL to fail the DLL load."
  },
  {
    "title": "ERROR_RECEIVE_PARTIAL",
    "code": 707,
    "msg": "{Partial Data Received} The network transport returned partial data to its client. The remaining data will be sent later."
  },
  {
    "title": "ERROR_RECEIVE_EXPEDITED",
    "code": 708,
    "msg": "{Expedited Data Received} The network transport returned data to its client that was marked as expedited by the remote system."
  },
  {
    "title": "ERROR_RECEIVE_PARTIAL_EXPEDITED",
    "code": 709,
    "msg": "{Partial Expedited Data Received} The network transport returned partial data to its client and this data was marked as expedited by the remote system. The remaining data will be sent later."
  },
  {
    "title": "ERROR_EVENT_DONE",
    "code": 710,
    "msg": "{TDI Event Done} The TDI indication has completed successfully."
  },
  {
    "title": "ERROR_EVENT_PENDING",
    "code": 711,
    "msg": "{TDI Event Pending} The TDI indication has entered the pending state."
  },
  {
    "title": "ERROR_CHECKING_FILE_SYSTEM",
    "code": 712,
    "msg": "Checking file system on %wZ."
  },
  {
    "title": "ERROR_FATAL_APP_EXIT",
    "code": 713,
    "msg": "{Fatal Application Exit} %hs."
  },
  {
    "title": "ERROR_PREDEFINED_HANDLE",
    "code": 714,
    "msg": "The specified registry key is referenced by a predefined handle."
  },
  {
    "title": "ERROR_WAS_UNLOCKED",
    "code": 715,
    "msg": "{Page Unlocked} The page protection of a locked page was changed to &#39;No Access&#39; and the page was unlocked from memory and from the process."
  },
  {
    "title": "ERROR_SERVICE_NOTIFICATION",
    "code": 716,
    "msg": "%hs"
  },
  {
    "title": "ERROR_WAS_LOCKED",
    "code": 717,
    "msg": "{Page Locked} One of the pages to lock was already locked."
  },
  {
    "title": "ERROR_LOG_HARD_ERROR",
    "code": 718,
    "msg": "Application popup: %1 : %2"
  },
  {
    "title": "ERROR_ALREADY_WIN32",
    "code": 719,
    "msg": "ERROR_ALREADY_WIN32"
  },
  {
    "title": "ERROR_IMAGE_MACHINE_TYPE_MISMATCH_EXE",
    "code": 720,
    "msg": "{Machine Type Mismatch} The image file %hs is valid, but is for a machine type other than the current machine."
  },
  {
    "title": "ERROR_NO_YIELD_PERFORMED",
    "code": 721,
    "msg": "A yield execution was performed and no thread was available to run."
  },
  {
    "title": "ERROR_TIMER_RESUME_IGNORED",
    "code": 722,
    "msg": "The resumable flag to a timer API was ignored."
  },
  {
    "title": "ERROR_ARBITRATION_UNHANDLED",
    "code": 723,
    "msg": "The arbiter has deferred arbitration of these resources to its parent."
  },
  {
    "title": "ERROR_CARDBUS_NOT_SUPPORTED",
    "code": 724,
    "msg": "The inserted CardBus device cannot be started because of a configuration error on &#34;%hs&#34;."
  },
  {
    "title": "ERROR_MP_PROCESSOR_MISMATCH",
    "code": 725,
    "msg": "The CPUs in this multiprocessor system are not all the same revision level. To use all processors the operating system restricts itself to the features of the least capable processor in the system. Should problems occur with this system, contact the CPU manufacturer to see if this mix of processors is supported."
  },
  {
    "title": "ERROR_HIBERNATED",
    "code": 726,
    "msg": "The system was put into hibernation."
  },
  {
    "title": "ERROR_RESUME_HIBERNATION",
    "code": 727,
    "msg": "The system was resumed from hibernation."
  },
  {
    "title": "ERROR_FIRMWARE_UPDATED",
    "code": 728,
    "msg": "Windows has detected that the system firmware (BIOS) was updated [previous firmware date = %2, current firmware date %3]."
  },
  {
    "title": "ERROR_DRIVERS_LEAKING_LOCKED_PAGES",
    "code": 729,
    "msg": "A device driver is leaking locked I/O pages causing system degradation. The system has automatically enabled tracking code in order to try and catch the culprit."
  },
  {
    "title": "ERROR_WAKE_SYSTEM",
    "code": 730,
    "msg": "The system has awoken."
  },
  {
    "title": "ERROR_WAIT_1",
    "code": 731,
    "msg": "ERROR_WAIT_1"
  },
  {
    "title": "ERROR_WAIT_2",
    "code": 732,
    "msg": "ERROR_WAIT_2"
  },
  {
    "title": "ERROR_WAIT_3",
    "code": 733,
    "msg": "ERROR_WAIT_3"
  },
  {
    "title": "ERROR_WAIT_63",
    "code": 734,
    "msg": "ERROR_WAIT_63"
  },
  {
    "title": "ERROR_ABANDONED_WAIT_0",
    "code": 735,
    "msg": "ERROR_ABANDONED_WAIT_0"
  },
  {
    "title": "ERROR_ABANDONED_WAIT_63",
    "code": 736,
    "msg": "ERROR_ABANDONED_WAIT_63"
  },
  {
    "title": "ERROR_USER_APC",
    "code": 737,
    "msg": "ERROR_USER_APC"
  },
  {
    "title": "ERROR_KERNEL_APC",
    "code": 738,
    "msg": "ERROR_KERNEL_APC"
  },
  {
    "title": "ERROR_ALERTED",
    "code": 739,
    "msg": "ERROR_ALERTED"
  },
  {
    "title": "ERROR_ELEVATION_REQUIRED",
    "code": 740,
    "msg": "The requested operation requires elevation."
  },
  {
    "title": "ERROR_REPARSE",
    "code": 741,
    "msg": "A reparse should be performed by the Object Manager since the name of the file resulted in a symbolic link."
  },
  {
    "title": "ERROR_OPLOCK_BREAK_IN_PROGRESS",
    "code": 742,
    "msg": "An open/create operation completed while an oplock break is underway."
  },
  {
    "title": "ERROR_VOLUME_MOUNTED",
    "code": 743,
    "msg": "A new volume has been mounted by a file system."
  },
  {
    "title": "ERROR_RXACT_COMMITTED",
    "code": 744,
    "msg": "This success level status indicates that the transaction state already exists for the registry sub-tree, but that a transaction commit was previously aborted. The commit has now been completed."
  },
  {
    "title": "ERROR_NOTIFY_CLEANUP",
    "code": 745,
    "msg": "This indicates that a notify change request has been completed due to closing the handle which made the notify change request."
  },
  {
    "title": "ERROR_PRIMARY_TRANSPORT_CONNECT_FAILED",
    "code": 746,
    "msg": "{Connect Failure on Primary Transport} An attempt was made to connect to the remote server %hs on the primary transport, but the connection failed. The computer WAS able to connect on a secondary transport."
  },
  {
    "title": "ERROR_PAGE_FAULT_TRANSITION",
    "code": 747,
    "msg": "Page fault was a transition fault."
  },
  {
    "title": "ERROR_PAGE_FAULT_DEMAND_ZERO",
    "code": 748,
    "msg": "Page fault was a demand zero fault."
  },
  {
    "title": "ERROR_PAGE_FAULT_COPY_ON_WRITE",
    "code": 749,
    "msg": "Page fault was a demand zero fault."
  },
  {
    "title": "ERROR_PAGE_FAULT_GUARD_PAGE",
    "code": 750,
    "msg": "Page fault was a demand zero fault."
  },
  {
    "title": "ERROR_PAGE_FAULT_PAGING_FILE",
    "code": 751,
    "msg": "Page fault was satisfied by reading from a secondary storage device."
  },
  {
    "title": "ERROR_CACHE_PAGE_LOCKED",
    "code": 752,
    "msg": "Cached page was locked during operation."
  },
  {
    "title": "ERROR_CRASH_DUMP",
    "code": 753,
    "msg": "Crash dump exists in paging file."
  },
  {
    "title": "ERROR_BUFFER_ALL_ZEROS",
    "code": 754,
    "msg": "Specified buffer contains all zeros."
  },
  {
    "title": "ERROR_REPARSE_OBJECT",
    "code": 755,
    "msg": "A reparse should be performed by the Object Manager since the name of the file resulted in a symbolic link."
  },
  {
    "title": "ERROR_RESOURCE_REQUIREMENTS_CHANGED",
    "code": 756,
    "msg": "The device has succeeded a query-stop and its resource requirements have changed."
  },
  {
    "title": "ERROR_TRANSLATION_COMPLETE",
    "code": 757,
    "msg": "The translator has translated these resources into the global space and no further translations should be performed."
  },
  {
    "title": "ERROR_NOTHING_TO_TERMINATE",
    "code": 758,
    "msg": "A process being terminated has no threads to terminate."
  },
  {
    "title": "ERROR_PROCESS_NOT_IN_JOB",
    "code": 759,
    "msg": "The specified process is not part of a job."
  },
  {
    "title": "ERROR_PROCESS_IN_JOB",
    "code": 760,
    "msg": "The specified process is part of a job."
  },
  {
    "title": "ERROR_VOLSNAP_HIBERNATE_READY",
    "code": 761,
    "msg": "{Volume Shadow Copy Service} The system is now ready for hibernation."
  },
  {
    "title": "ERROR_FSFILTER_OP_COMPLETED_SUCCESSFULLY",
    "code": 762,
    "msg": "A file system or file system filter driver has successfully completed an FsFilter operation."
  },
  {
    "title": "ERROR_INTERRUPT_VECTOR_ALREADY_CONNECTED",
    "code": 763,
    "msg": "The specified interrupt vector was already connected."
  },
  {
    "title": "ERROR_INTERRUPT_STILL_CONNECTED",
    "code": 764,
    "msg": "The specified interrupt vector is still connected."
  },
  {
    "title": "ERROR_WAIT_FOR_OPLOCK",
    "code": 765,
    "msg": "An operation is blocked waiting for an oplock."
  },
  {
    "title": "ERROR_DBG_EXCEPTION_HANDLED",
    "code": 766,
    "msg": "Debugger handled exception."
  },
  {
    "title": "ERROR_DBG_CONTINUE",
    "code": 767,
    "msg": "Debugger continued."
  },
  {
    "title": "ERROR_CALLBACK_POP_STACK",
    "code": 768,
    "msg": "An exception occurred in a user mode callback and the kernel callback frame should be removed."
  },
  {
    "title": "ERROR_COMPRESSION_DISABLED",
    "code": 769,
    "msg": "Compression is disabled for this volume."
  },
  {
    "title": "ERROR_CANTFETCHBACKWARDS",
    "code": 770,
    "msg": "The data provider cannot fetch backwards through a result set."
  },
  {
    "title": "ERROR_CANTSCROLLBACKWARDS",
    "code": 771,
    "msg": "The data provider cannot scroll backwards through a result set."
  },
  {
    "title": "ERROR_ROWSNOTRELEASED",
    "code": 772,
    "msg": "The data provider requires that previously fetched data is released before asking for more data."
  },
  {
    "title": "ERROR_BAD_ACCESSOR_FLAGS",
    "code": 773,
    "msg": "The data provider was not able to interpret the flags set for a column binding in an accessor."
  },
  {
    "title": "ERROR_ERRORS_ENCOUNTERED",
    "code": 774,
    "msg": "One or more errors occurred while processing the request."
  },
  {
    "title": "ERROR_NOT_CAPABLE",
    "code": 775,
    "msg": "The implementation is not capable of performing the request."
  },
  {
    "title": "ERROR_REQUEST_OUT_OF_SEQUENCE",
    "code": 776,
    "msg": "The client of a component requested an operation which is not valid given the state of the component instance."
  },
  {
    "title": "ERROR_VERSION_PARSE_ERROR",
    "code": 777,
    "msg": "A version number could not be parsed."
  },
  {
    "title": "ERROR_BADSTARTPOSITION",
    "code": 778,
    "msg": "The iterator&#39;s start position is invalid."
  },
  {
    "title": "ERROR_MEMORY_HARDWARE",
    "code": 779,
    "msg": "The hardware has reported an uncorrectable memory error."
  },
  {
    "title": "ERROR_DISK_REPAIR_DISABLED",
    "code": 780,
    "msg": "The attempted operation required self healing to be enabled."
  },
  {
    "title": "ERROR_INSUFFICIENT_RESOURCE_FOR_SPECIFIED_SHARED_SECTION_SIZE",
    "code": 781,
    "msg": "The Desktop heap encountered an error while allocating session memory. There is more information in the system event log."
  },
  {
    "title": "ERROR_SYSTEM_POWERSTATE_TRANSITION",
    "code": 782,
    "msg": "The system power state is transitioning from %2 to %3."
  },
  {
    "title": "ERROR_SYSTEM_POWERSTATE_COMPLEX_TRANSITION",
    "code": 783,
    "msg": "The system power state is transitioning from %2 to %3 but could enter %4."
  },
  {
    "title": "ERROR_MCA_EXCEPTION",
    "code": 784,
    "msg": "A thread is getting dispatched with MCA EXCEPTION because of MCA."
  },
  {
    "title": "ERROR_ACCESS_AUDIT_BY_POLICY",
    "code": 785,
    "msg": "Access to %1 is monitored by policy rule %2."
  },
  {
    "title": "ERROR_ACCESS_DISABLED_NO_SAFER_UI_BY_POLICY",
    "code": 786,
    "msg": "Access to %1 has been restricted by your Administrator by policy rule %2."
  },
  {
    "title": "ERROR_ABANDON_HIBERFILE",
    "code": 787,
    "msg": "A valid hibernation file has been invalidated and should be abandoned."
  },
  {
    "title": "ERROR_LOST_WRITEBEHIND_DATA_NETWORK_DISCONNECTED",
    "code": 788,
    "msg": "{Delayed Write Failed} Windows was unable to save all the data for the file %hs; the data has been lost. This error may be caused by network connectivity issues. Please try to save this file elsewhere."
  },
  {
    "title": "ERROR_LOST_WRITEBEHIND_DATA_NETWORK_SERVER_ERROR",
    "code": 789,
    "msg": "{Delayed Write Failed} Windows was unable to save all the data for the file %hs; the data has been lost. This error was returned by the server on which the file exists. Please try to save this file elsewhere."
  },
  {
    "title": "ERROR_LOST_WRITEBEHIND_DATA_LOCAL_DISK_ERROR",
    "code": 790,
    "msg": "{Delayed Write Failed} Windows was unable to save all the data for the file %hs; the data has been lost. This error may be caused if the device has been removed or the media is write-protected."
  },
  {
    "title": "ERROR_BAD_MCFG_TABLE",
    "code": 791,
    "msg": "The resources required for this device conflict with the MCFG table."
  },
  {
    "title": "ERROR_DISK_REPAIR_REDIRECTED",
    "code": 792,
    "msg": "The volume repair could not be performed while it is online. Please schedule to take the volume offline so that it can be repaired."
  },
  {
    "title": "ERROR_DISK_REPAIR_UNSUCCESSFUL",
    "code": 793,
    "msg": "The volume repair was not successful."
  },
  {
    "title": "ERROR_CORRUPT_LOG_OVERFULL",
    "code": 794,
    "msg": "One of the volume corruption logs is full. Further corruptions that may be detected won&#39;t be logged."
  },
  {
    "title": "ERROR_CORRUPT_LOG_CORRUPTED",
    "code": 795,
    "msg": "One of the volume corruption logs is internally corrupted and needs to be recreated. The volume may contain undetected corruptions and must be scanned."
  },
  {
    "title": "ERROR_CORRUPT_LOG_UNAVAILABLE",
    "code": 796,
    "msg": "One of the volume corruption logs is unavailable for being operated on."
  },
  {
    "title": "ERROR_CORRUPT_LOG_DELETED_FULL",
    "code": 797,
    "msg": "One of the volume corruption logs was deleted while still having corruption records in them. The volume contains detected corruptions and must be scanned."
  },
  {
    "title": "ERROR_CORRUPT_LOG_CLEARED",
    "code": 798,
    "msg": "One of the volume corruption logs was cleared by chkdsk and no longer contains real corruptions."
  },
  {
    "title": "ERROR_ORPHAN_NAME_EXHAUSTED",
    "code": 799,
    "msg": "Orphaned files exist on the volume but could not be recovered because no more new names could be created in the recovery directory. Files must be moved from the recovery directory."
  },
  {
    "title": "ERROR_OPLOCK_SWITCHED_TO_NEW_HANDLE",
    "code": 800,
    "msg": "The oplock that was associated with this handle is now associated with a different handle."
  },
  {
    "title": "ERROR_CANNOT_GRANT_REQUESTED_OPLOCK",
    "code": 801,
    "msg": "An oplock of the requested level cannot be granted. An oplock of a lower level may be available."
  },
  {
    "title": "ERROR_CANNOT_BREAK_OPLOCK",
    "code": 802,
    "msg": "The operation did not complete successfully because it would cause an oplock to be broken. The caller has requested that existing oplocks not be broken."
  },
  {
    "title": "ERROR_OPLOCK_HANDLE_CLOSED",
    "code": 803,
    "msg": "The handle with which this oplock was associated has been closed. The oplock is now broken."
  },
  {
    "title": "ERROR_NO_ACE_CONDITION",
    "code": 804,
    "msg": "The specified access control entry (ACE) does not contain a condition."
  },
  {
    "title": "ERROR_INVALID_ACE_CONDITION",
    "code": 805,
    "msg": "The specified access control entry (ACE) contains an invalid condition."
  },
  {
    "title": "ERROR_FILE_HANDLE_REVOKED",
    "code": 806,
    "msg": "Access to the specified file handle has been revoked."
  },
  {
    "title": "ERROR_IMAGE_AT_DIFFERENT_BASE",
    "code": 807,
    "msg": "An image file was mapped at a different address from the one specified in the image file but fixups will still be automatically performed on the image."
  },
  {
    "title": "ERROR_EA_ACCESS_DENIED",
    "code": 994,
    "msg": "Access to the extended attribute was denied."
  },
  {
    "title": "ERROR_OPERATION_ABORTED",
    "code": 995,
    "msg": "The I/O operation has been aborted because of either a thread exit or an application request."
  },
  {
    "title": "ERROR_IO_INCOMPLETE",
    "code": 996,
    "msg": "Overlapped I/O event is not in a signaled state."
  },
  {
    "title": "ERROR_IO_PENDING",
    "code": 997,
    "msg": "Overlapped I/O operation is in progress."
  },
  {
    "title": "ERROR_NOACCESS",
    "code": 998,
    "msg": "Invalid access to memory location."
  },
  {
    "title": "ERROR_SWAPERROR",
    "code": 999,
    "msg": "Error performing inpage operation."
  }
]
