[
  {
    "title": "ERROR_ENCRYPTION_FAILED",
    "code": 6000,
    "msg": "The specified file could not be encrypted."
  },
  {
    "title": "ERROR_DECRYPTION_FAILED",
    "code": 6001,
    "msg": "The specified file could not be decrypted."
  },
  {
    "title": "ERROR_FILE_ENCRYPTED",
    "code": 6002,
    "msg": "The specified file is encrypted and the user does not have the ability to decrypt it."
  },
  {
    "title": "ERROR_NO_RECOVERY_POLICY",
    "code": 6003,
    "msg": "There is no valid encryption recovery policy configured for this system."
  },
  {
    "title": "ERROR_NO_EFS",
    "code": 6004,
    "msg": "The required encryption driver is not loaded for this system."
  },
  {
    "title": "ERROR_WRONG_EFS",
    "code": 6005,
    "msg": "The file was encrypted with a different encryption driver than is currently loaded."
  },
  {
    "title": "ERROR_NO_USER_KEYS",
    "code": 6006,
    "msg": "There are no EFS keys defined for the user."
  },
  {
    "title": "ERROR_FILE_NOT_ENCRYPTED",
    "code": 6007,
    "msg": "The specified file is not encrypted."
  },
  {
    "title": "ERROR_NOT_EXPORT_FORMAT",
    "code": 6008,
    "msg": "The specified file is not in the defined EFS export format."
  },
  {
    "title": "ERROR_FILE_READ_ONLY",
    "code": 6009,
    "msg": "The specified file is read only."
  },
  {
    "title": "ERROR_DIR_EFS_DISALLOWED",
    "code": 6010,
    "msg": "The directory has been disabled for encryption."
  },
  {
    "title": "ERROR_EFS_SERVER_NOT_TRUSTED",
    "code": 6011,
    "msg": "The server is not trusted for remote encryption operation."
  },
  {
    "title": "ERROR_BAD_RECOVERY_POLICY",
    "code": 6012,
    "msg": "Recovery policy configured for this system contains invalid recovery certificate."
  },
  {
    "title": "ERROR_EFS_ALG_BLOB_TOO_BIG",
    "code": 6013,
    "msg": "The encryption algorithm used on the source file needs a bigger key buffer than the one on the destination file."
  },
  {
    "title": "ERROR_VOLUME_NOT_SUPPORT_EFS",
    "code": 6014,
    "msg": "The disk partition does not support file encryption."
  },
  {
    "title": "ERROR_EFS_DISABLED",
    "code": 6015,
    "msg": "This machine is disabled for file encryption."
  },
  {
    "title": "ERROR_EFS_VERSION_NOT_SUPPORT",
    "code": 6016,
    "msg": "A newer system is required to decrypt this encrypted file."
  },
  {
    "title": "ERROR_CS_ENCRYPTION_INVALID_SERVER_RESPONSE",
    "code": 6017,
    "msg": "The remote server sent an invalid response for a file being opened with Client Side Encryption."
  },
  {
    "title": "ERROR_CS_ENCRYPTION_UNSUPPORTED_SERVER",
    "code": 6018,
    "msg": "Client Side Encryption is not supported by the remote server even though it claims to support it."
  },
  {
    "title": "ERROR_CS_ENCRYPTION_EXISTING_ENCRYPTED_FILE",
    "code": 6019,
    "msg": "File is encrypted and should be opened in Client Side Encryption mode."
  },
  {
    "title": "ERROR_CS_ENCRYPTION_NEW_ENCRYPTED_FILE",
    "code": 6020,
    "msg": "A new encrypted file is being created and a $EFS needs to be provided."
  },
  {
    "title": "ERROR_CS_ENCRYPTION_FILE_NOT_CSE",
    "code": 6021,
    "msg": "The SMB client requested a CSE FSCTL on a non-CSE file."
  },
  {
    "title": "ERROR_ENCRYPTION_POLICY_DENIES_OPERATION",
    "code": 6022,
    "msg": "The requested operation was blocked by policy. For more information, contact your system administrator."
  },
  {
    "title": "ERROR_NO_BROWSER_SERVERS_FOUND",
    "code": 6118,
    "msg": "The list of servers for this workgroup is not currently available."
  },
  {
    "title": "SCHED_E_SERVICE_NOT_LOCALSYSTEM",
    "code": 6200,
    "msg": "The Task Scheduler service must be configured to run in the System account to function properly. Individual tasks may be configured to run in other accounts."
  },
  {
    "title": "ERROR_LOG_SECTOR_INVALID",
    "code": 6600,
    "msg": "Log service encountered an invalid log sector."
  },
  {
    "title": "ERROR_LOG_SECTOR_PARITY_INVALID",
    "code": 6601,
    "msg": "Log service encountered a log sector with invalid block parity."
  },
  {
    "title": "ERROR_LOG_SECTOR_REMAPPED",
    "code": 6602,
    "msg": "Log service encountered a remapped log sector."
  },
  {
    "title": "ERROR_LOG_BLOCK_INCOMPLETE",
    "code": 6603,
    "msg": "Log service encountered a partial or incomplete log block."
  },
  {
    "title": "ERROR_LOG_INVALID_RANGE",
    "code": 6604,
    "msg": "Log service encountered an attempt access data outside the active log range."
  },
  {
    "title": "ERROR_LOG_BLOCKS_EXHAUSTED",
    "code": 6605,
    "msg": "Log service user marshalling buffers are exhausted."
  },
  {
    "title": "ERROR_LOG_READ_CONTEXT_INVALID",
    "code": 6606,
    "msg": "Log service encountered an attempt read from a marshalling area with an invalid read context."
  },
  {
    "title": "ERROR_LOG_RESTART_INVALID",
    "code": 6607,
    "msg": "Log service encountered an invalid log restart area."
  },
  {
    "title": "ERROR_LOG_BLOCK_VERSION",
    "code": 6608,
    "msg": "Log service encountered an invalid log block version."
  },
  {
    "title": "ERROR_LOG_BLOCK_INVALID",
    "code": 6609,
    "msg": "Log service encountered an invalid log block."
  },
  {
    "title": "ERROR_LOG_READ_MODE_INVALID",
    "code": 6610,
    "msg": "Log service encountered an attempt to read the log with an invalid read mode."
  },
  {
    "title": "ERROR_LOG_NO_RESTART",
    "code": 6611,
    "msg": "Log service encountered a log stream with no restart area."
  },
  {
    "title": "ERROR_LOG_METADATA_CORRUPT",
    "code": 6612,
    "msg": "Log service encountered a corrupted metadata file."
  },
  {
    "title": "ERROR_LOG_METADATA_INVALID",
    "code": 6613,
    "msg": "Log service encountered a metadata file that could not be created by the log file system."
  },
  {
    "title": "ERROR_LOG_METADATA_INCONSISTENT",
    "code": 6614,
    "msg": "Log service encountered a metadata file with inconsistent data."
  },
  {
    "title": "ERROR_LOG_RESERVATION_INVALID",
    "code": 6615,
    "msg": "Log service encountered an attempt to erroneous allocate or dispose reservation space."
  },
  {
    "title": "ERROR_LOG_CANT_DELETE",
    "code": 6616,
    "msg": "Log service cannot delete log file or file system container."
  },
  {
    "title": "ERROR_LOG_CONTAINER_LIMIT_EXCEEDED",
    "code": 6617,
    "msg": "Log service has reached the maximum allowable containers allocated to a log file."
  },
  {
    "title": "ERROR_LOG_START_OF_LOG",
    "code": 6618,
    "msg": "Log service has attempted to read or write backward past the start of the log."
  },
  {
    "title": "ERROR_LOG_POLICY_ALREADY_INSTALLED",
    "code": 6619,
    "msg": "Log policy could not be installed because a policy of the same type is already present."
  },
  {
    "title": "ERROR_LOG_POLICY_NOT_INSTALLED",
    "code": 6620,
    "msg": "Log policy in question was not installed at the time of the request."
  },
  {
    "title": "ERROR_LOG_POLICY_INVALID",
    "code": 6621,
    "msg": "The installed set of policies on the log is invalid."
  },
  {
    "title": "ERROR_LOG_POLICY_CONFLICT",
    "code": 6622,
    "msg": "A policy on the log in question prevented the operation from completing."
  },
  {
    "title": "ERROR_LOG_PINNED_ARCHIVE_TAIL",
    "code": 6623,
    "msg": "Log space cannot be reclaimed because the log is pinned by the archive tail."
  },
  {
    "title": "ERROR_LOG_RECORD_NONEXISTENT",
    "code": 6624,
    "msg": "Log record is not a record in the log file."
  },
  {
    "title": "ERROR_LOG_RECORDS_RESERVED_INVALID",
    "code": 6625,
    "msg": "Number of reserved log records or the adjustment of the number of reserved log records is invalid."
  },
  {
    "title": "ERROR_LOG_SPACE_RESERVED_INVALID",
    "code": 6626,
    "msg": "Reserved log space or the adjustment of the log space is invalid."
  },
  {
    "title": "ERROR_LOG_TAIL_INVALID",
    "code": 6627,
    "msg": "An new or existing archive tail or base of the active log is invalid."
  },
  {
    "title": "ERROR_LOG_FULL",
    "code": 6628,
    "msg": "Log space is exhausted."
  },
  {
    "title": "ERROR_COULD_NOT_RESIZE_LOG",
    "code": 6629,
    "msg": "The log could not be set to the requested size."
  },
  {
    "title": "ERROR_LOG_MULTIPLEXED",
    "code": 6630,
    "msg": "Log is multiplexed, no direct writes to the physical log is allowed."
  },
  {
    "title": "ERROR_LOG_DEDICATED",
    "code": 6631,
    "msg": "The operation failed because the log is a dedicated log."
  },
  {
    "title": "ERROR_LOG_ARCHIVE_NOT_IN_PROGRESS",
    "code": 6632,
    "msg": "The operation requires an archive context."
  },
  {
    "title": "ERROR_LOG_ARCHIVE_IN_PROGRESS",
    "code": 6633,
    "msg": "Log archival is in progress."
  },
  {
    "title": "ERROR_LOG_EPHEMERAL",
    "code": 6634,
    "msg": "The operation requires a non-ephemeral log, but the log is ephemeral."
  },
  {
    "title": "ERROR_LOG_NOT_ENOUGH_CONTAINERS",
    "code": 6635,
    "msg": "The log must have at least two containers before it can be read from or written to."
  },
  {
    "title": "ERROR_LOG_CLIENT_ALREADY_REGISTERED",
    "code": 6636,
    "msg": "A log client has already registered on the stream."
  },
  {
    "title": "ERROR_LOG_CLIENT_NOT_REGISTERED",
    "code": 6637,
    "msg": "A log client has not been registered on the stream."
  },
  {
    "title": "ERROR_LOG_FULL_HANDLER_IN_PROGRESS",
    "code": 6638,
    "msg": "A request has already been made to handle the log full condition."
  },
  {
    "title": "ERROR_LOG_CONTAINER_READ_FAILED",
    "code": 6639,
    "msg": "Log service encountered an error when attempting to read from a log container."
  },
  {
    "title": "ERROR_LOG_CONTAINER_WRITE_FAILED",
    "code": 6640,
    "msg": "Log service encountered an error when attempting to write to a log container."
  },
  {
    "title": "ERROR_LOG_CONTAINER_OPEN_FAILED",
    "code": 6641,
    "msg": "Log service encountered an error when attempting open a log container."
  },
  {
    "title": "ERROR_LOG_CONTAINER_STATE_INVALID",
    "code": 6642,
    "msg": "Log service encountered an invalid container state when attempting a requested action."
  },
  {
    "title": "ERROR_LOG_STATE_INVALID",
    "code": 6643,
    "msg": "Log service is not in the correct state to perform a requested action."
  },
  {
    "title": "ERROR_LOG_PINNED",
    "code": 6644,
    "msg": "Log space cannot be reclaimed because the log is pinned."
  },
  {
    "title": "ERROR_LOG_METADATA_FLUSH_FAILED",
    "code": 6645,
    "msg": "Log metadata flush failed."
  },
  {
    "title": "ERROR_LOG_INCONSISTENT_SECURITY",
    "code": 6646,
    "msg": "Security on the log and its containers is inconsistent."
  },
  {
    "title": "ERROR_LOG_APPENDED_FLUSH_FAILED",
    "code": 6647,
    "msg": "Records were appended to the log or reservation changes were made, but the log could not be flushed."
  },
  {
    "title": "ERROR_LOG_PINNED_RESERVATION",
    "code": 6648,
    "msg": "The log is pinned due to reservation consuming most of the log space. Free some reserved records to make space available."
  },
  {
    "title": "ERROR_INVALID_TRANSACTION",
    "code": 6700,
    "msg": "The transaction handle associated with this operation is not valid."
  },
  {
    "title": "ERROR_TRANSACTION_NOT_ACTIVE",
    "code": 6701,
    "msg": "The requested operation was made in the context of a transaction that is no longer active."
  },
  {
    "title": "ERROR_TRANSACTION_REQUEST_NOT_VALID",
    "code": 6702,
    "msg": "The requested operation is not valid on the Transaction object in its current state."
  },
  {
    "title": "ERROR_TRANSACTION_NOT_REQUESTED",
    "code": 6703,
    "msg": "The caller has called a response API, but the response is not expected because the TM did not issue the corresponding request to the caller."
  },
  {
    "title": "ERROR_TRANSACTION_ALREADY_ABORTED",
    "code": 6704,
    "msg": "It is too late to perform the requested operation, since the Transaction has already been aborted."
  },
  {
    "title": "ERROR_TRANSACTION_ALREADY_COMMITTED",
    "code": 6705,
    "msg": "It is too late to perform the requested operation, since the Transaction has already been committed."
  },
  {
    "title": "ERROR_TM_INITIALIZATION_FAILED",
    "code": 6706,
    "msg": "The Transaction Manager was unable to be successfully initialized. Transacted operations are not supported."
  },
  {
    "title": "ERROR_RESOURCEMANAGER_READ_ONLY",
    "code": 6707,
    "msg": "The specified ResourceManager made no changes or updates to the resource under this transaction."
  },
  {
    "title": "ERROR_TRANSACTION_NOT_JOINED",
    "code": 6708,
    "msg": "The resource manager has attempted to prepare a transaction that it has not successfully joined."
  },
  {
    "title": "ERROR_TRANSACTION_SUPERIOR_EXISTS",
    "code": 6709,
    "msg": "The Transaction object already has a superior enlistment, and the caller attempted an operation that would have created a new superior. Only a single superior enlistment is allow."
  },
  {
    "title": "ERROR_CRM_PROTOCOL_ALREADY_EXISTS",
    "code": 6710,
    "msg": "The RM tried to register a protocol that already exists."
  },
  {
    "title": "ERROR_TRANSACTION_PROPAGATION_FAILED",
    "code": 6711,
    "msg": "The attempt to propagate the Transaction failed."
  },
  {
    "title": "ERROR_CRM_PROTOCOL_NOT_FOUND",
    "code": 6712,
    "msg": "The requested propagation protocol was not registered as a CRM."
  },
  {
    "title": "ERROR_TRANSACTION_INVALID_MARSHALL_BUFFER",
    "code": 6713,
    "msg": "The buffer passed in to PushTransaction or PullTransaction is not in a valid format."
  },
  {
    "title": "ERROR_CURRENT_TRANSACTION_NOT_VALID",
    "code": 6714,
    "msg": "The current transaction context associated with the thread is not a valid handle to a transaction object."
  },
  {
    "title": "ERROR_TRANSACTION_NOT_FOUND",
    "code": 6715,
    "msg": "The specified Transaction object could not be opened, because it was not found."
  },
  {
    "title": "ERROR_RESOURCEMANAGER_NOT_FOUND",
    "code": 6716,
    "msg": "The specified ResourceManager object could not be opened, because it was not found."
  },
  {
    "title": "ERROR_ENLISTMENT_NOT_FOUND",
    "code": 6717,
    "msg": "The specified Enlistment object could not be opened, because it was not found."
  },
  {
    "title": "ERROR_TRANSACTIONMANAGER_NOT_FOUND",
    "code": 6718,
    "msg": "The specified TransactionManager object could not be opened, because it was not found."
  },
  {
    "title": "ERROR_TRANSACTIONMANAGER_NOT_ONLINE",
    "code": 6719,
    "msg": "The object specified could not be created or opened, because its associated TransactionManager is not online. The TransactionManager must be brought fully Online by calling RecoverTransactionManager to recover to the end of its LogFile before objects in its Transaction or ResourceManager namespaces can be opened. In addition, errors in writing records to its LogFile can cause a TransactionManager to go offline."
  },
  {
    "title": "ERROR_TRANSACTIONMANAGER_RECOVERY_NAME_COLLISION",
    "code": 6720,
    "msg": "The specified TransactionManager was unable to create the objects contained in its logfile in the Ob namespace. Therefore, the TransactionManager was unable to recover."
  },
  {
    "title": "ERROR_TRANSACTION_NOT_ROOT",
    "code": 6721,
    "msg": "The call to create a superior Enlistment on this Transaction object could not be completed, because the Transaction object specified for the enlistment is a subordinate branch of the Transaction. Only the root of the Transaction can be enlisted on as a superior."
  },
  {
    "title": "ERROR_TRANSACTION_OBJECT_EXPIRED",
    "code": 6722,
    "msg": "Because the associated transaction manager or resource manager has been closed, the handle is no longer valid."
  },
  {
    "title": "ERROR_TRANSACTION_RESPONSE_NOT_ENLISTED",
    "code": 6723,
    "msg": "The specified operation could not be performed on this Superior enlistment, because the enlistment was not created with the corresponding completion response in the NotificationMask."
  },
  {
    "title": "ERROR_TRANSACTION_RECORD_TOO_LONG",
    "code": 6724,
    "msg": "The specified operation could not be performed, because the record that would be logged was too long. This can occur because of two conditions: either there are too many Enlistments on this Transaction, or the combined RecoveryInformation being logged on behalf of those Enlistments is too long."
  },
  {
    "title": "ERROR_IMPLICIT_TRANSACTION_NOT_SUPPORTED",
    "code": 6725,
    "msg": "Implicit transaction are not supported."
  },
  {
    "title": "ERROR_TRANSACTION_INTEGRITY_VIOLATED",
    "code": 6726,
    "msg": "The kernel transaction manager had to abort or forget the transaction because it blocked forward progress."
  },
  {
    "title": "ERROR_TRANSACTIONMANAGER_IDENTITY_MISMATCH",
    "code": 6727,
    "msg": "The TransactionManager identity that was supplied did not match the one recorded in the TransactionManager&#39;s log file."
  },
  {
    "title": "ERROR_RM_CANNOT_BE_FROZEN_FOR_SNAPSHOT",
    "code": 6728,
    "msg": "This snapshot operation cannot continue because a transactional resource manager cannot be frozen in its current state. Please try again."
  },
  {
    "title": "ERROR_TRANSACTION_MUST_WRITETHROUGH",
    "code": 6729,
    "msg": "The transaction cannot be enlisted on with the specified EnlistmentMask, because the transaction has already completed the PrePrepare phase. In order to ensure correctness, the ResourceManager must switch to a write- through mode and cease caching data within this transaction. Enlisting for only subsequent transaction phases may still succeed."
  },
  {
    "title": "ERROR_TRANSACTION_NO_SUPERIOR",
    "code": 6730,
    "msg": "The transaction does not have a superior enlistment."
  },
  {
    "title": "ERROR_HEURISTIC_DAMAGE_POSSIBLE",
    "code": 6731,
    "msg": "The attempt to commit the Transaction completed, but it is possible that some portion of the transaction tree did not commit successfully due to heuristics. Therefore it is possible that some data modified in the transaction may not have committed, resulting in transactional inconsistency. If possible, check the consistency of the associated data."
  },
  {
    "title": "ERROR_TRANSACTIONAL_CONFLICT",
    "code": 6800,
    "msg": "The function attempted to use a name that is reserved for use by another transaction."
  },
  {
    "title": "ERROR_RM_NOT_ACTIVE",
    "code": 6801,
    "msg": "Transaction support within the specified resource manager is not started or was shut down due to an error."
  },
  {
    "title": "ERROR_RM_METADATA_CORRUPT",
    "code": 6802,
    "msg": "The metadata of the RM has been corrupted. The RM will not function."
  },
  {
    "title": "ERROR_DIRECTORY_NOT_RM",
    "code": 6803,
    "msg": "The specified directory does not contain a resource manager."
  },
  {
    "title": "ERROR_TRANSACTIONS_UNSUPPORTED_REMOTE",
    "code": 6805,
    "msg": "The remote server or share does not support transacted file operations."
  },
  {
    "title": "ERROR_LOG_RESIZE_INVALID_SIZE",
    "code": 6806,
    "msg": "The requested log size is invalid."
  },
  {
    "title": "ERROR_OBJECT_NO_LONGER_EXISTS",
    "code": 6807,
    "msg": "The object (file, stream, link) corresponding to the handle has been deleted by a Transaction Savepoint Rollback."
  },
  {
    "title": "ERROR_STREAM_MINIVERSION_NOT_FOUND",
    "code": 6808,
    "msg": "The specified file miniversion was not found for this transacted file open."
  },
  {
    "title": "ERROR_STREAM_MINIVERSION_NOT_VALID",
    "code": 6809,
    "msg": "The specified file miniversion was found but has been invalidated. Most likely cause is a transaction savepoint rollback."
  },
  {
    "title": "ERROR_MINIVERSION_INACCESSIBLE_FROM_SPECIFIED_TRANSACTION",
    "code": 6810,
    "msg": "A miniversion may only be opened in the context of the transaction that created it."
  },
  {
    "title": "ERROR_CANT_OPEN_MINIVERSION_WITH_MODIFY_INTENT",
    "code": 6811,
    "msg": "It is not possible to open a miniversion with modify access."
  },
  {
    "title": "ERROR_CANT_CREATE_MORE_STREAM_MINIVERSIONS",
    "code": 6812,
    "msg": "It is not possible to create any more miniversions for this stream."
  },
  {
    "title": "ERROR_REMOTE_FILE_VERSION_MISMATCH",
    "code": 6814,
    "msg": "The remote server sent mismatching version number or Fid for a file opened with transactions."
  },
  {
    "title": "ERROR_HANDLE_NO_LONGER_VALID",
    "code": 6815,
    "msg": "The handle has been invalidated by a transaction. The most likely cause is the presence of memory mapping on a file or an open handle when the transaction ended or rolled back to savepoint."
  },
  {
    "title": "ERROR_NO_TXF_METADATA",
    "code": 6816,
    "msg": "There is no transaction metadata on the file."
  },
  {
    "title": "ERROR_LOG_CORRUPTION_DETECTED",
    "code": 6817,
    "msg": "The log data is corrupt."
  },
  {
    "title": "ERROR_CANT_RECOVER_WITH_HANDLE_OPEN",
    "code": 6818,
    "msg": "The file can&#39;t be recovered because there is a handle still open on it."
  },
  {
    "title": "ERROR_RM_DISCONNECTED",
    "code": 6819,
    "msg": "The transaction outcome is unavailable because the resource manager responsible for it has disconnected."
  },
  {
    "title": "ERROR_ENLISTMENT_NOT_SUPERIOR",
    "code": 6820,
    "msg": "The request was rejected because the enlistment in question is not a superior enlistment."
  },
  {
    "title": "ERROR_RECOVERY_NOT_NEEDED",
    "code": 6821,
    "msg": "The transactional resource manager is already consistent. Recovery is not needed."
  },
  {
    "title": "ERROR_RM_ALREADY_STARTED",
    "code": 6822,
    "msg": "The transactional resource manager has already been started."
  },
  {
    "title": "ERROR_FILE_IDENTITY_NOT_PERSISTENT",
    "code": 6823,
    "msg": "The file cannot be opened transactionally, because its identity depends on the outcome of an unresolved transaction."
  },
  {
    "title": "ERROR_CANT_BREAK_TRANSACTIONAL_DEPENDENCY",
    "code": 6824,
    "msg": "The operation cannot be performed because another transaction is depending on the fact that this property will not change."
  },
  {
    "title": "ERROR_CANT_CROSS_RM_BOUNDARY",
    "code": 6825,
    "msg": "The operation would involve a single file with two transactional resource managers and is therefore not allowed."
  },
  {
    "title": "ERROR_TXF_DIR_NOT_EMPTY",
    "code": 6826,
    "msg": "The $Txf directory must be empty for this operation to succeed."
  },
  {
    "title": "ERROR_INDOUBT_TRANSACTIONS_EXIST",
    "code": 6827,
    "msg": "The operation would leave a transactional resource manager in an inconsistent state and is therefore not allowed."
  },
  {
    "title": "ERROR_TM_VOLATILE",
    "code": 6828,
    "msg": "The operation could not be completed because the transaction manager does not have a log."
  },
  {
    "title": "ERROR_ROLLBACK_TIMER_EXPIRED",
    "code": 6829,
    "msg": "A rollback could not be scheduled because a previously scheduled rollback has already executed or been queued for execution."
  },
  {
    "title": "ERROR_TXF_ATTRIBUTE_CORRUPT",
    "code": 6830,
    "msg": "The transactional metadata attribute on the file or directory is corrupt and unreadable."
  },
  {
    "title": "ERROR_EFS_NOT_ALLOWED_IN_TRANSACTION",
    "code": 6831,
    "msg": "The encryption operation could not be completed because a transaction is active."
  },
  {
    "title": "ERROR_TRANSACTIONAL_OPEN_NOT_ALLOWED",
    "code": 6832,
    "msg": "This object is not allowed to be opened in a transaction."
  },
  {
    "title": "ERROR_LOG_GROWTH_FAILED",
    "code": 6833,
    "msg": "An attempt to create space in the transactional resource manager&#39;s log failed. The failure status has been recorded in the event log."
  },
  {
    "title": "ERROR_TRANSACTED_MAPPING_UNSUPPORTED_REMOTE",
    "code": 6834,
    "msg": "Memory mapping (creating a mapped section) a remote file under a transaction is not supported."
  },
  {
    "title": "ERROR_TXF_METADATA_ALREADY_PRESENT",
    "code": 6835,
    "msg": "Transaction metadata is already present on this file and cannot be superseded."
  },
  {
    "title": "ERROR_TRANSACTION_SCOPE_CALLBACKS_NOT_SET",
    "code": 6836,
    "msg": "A transaction scope could not be entered because the scope handler has not been initialized."
  },
  {
    "title": "ERROR_TRANSACTION_REQUIRED_PROMOTION",
    "code": 6837,
    "msg": "Promotion was required in order to allow the resource manager to enlist, but the transaction was set to disallow it."
  },
  {
    "title": "ERROR_CANNOT_EXECUTE_FILE_IN_TRANSACTION",
    "code": 6838,
    "msg": "This file is open for modification in an unresolved transaction and may be opened for execute only by a transacted reader."
  },
  {
    "title": "ERROR_TRANSACTIONS_NOT_FROZEN",
    "code": 6839,
    "msg": "The request to thaw frozen transactions was ignored because transactions had not previously been frozen."
  },
  {
    "title": "ERROR_TRANSACTION_FREEZE_IN_PROGRESS",
    "code": 6840,
    "msg": "Transactions cannot be frozen because a freeze is already in progress."
  },
  {
    "title": "ERROR_NOT_SNAPSHOT_VOLUME",
    "code": 6841,
    "msg": "The target volume is not a snapshot volume. This operation is only valid on a volume mounted as a snapshot."
  },
  {
    "title": "ERROR_NO_SAVEPOINT_WITH_OPEN_FILES",
    "code": 6842,
    "msg": "The savepoint operation failed because files are open on the transaction. This is not permitted."
  },
  {
    "title": "ERROR_DATA_LOST_REPAIR",
    "code": 6843,
    "msg": "Windows has discovered corruption in a file, and that file has since been repaired. Data loss may have occurred."
  },
  {
    "title": "ERROR_SPARSE_NOT_ALLOWED_IN_TRANSACTION",
    "code": 6844,
    "msg": "The sparse operation could not be completed because a transaction is active on the file."
  },
  {
    "title": "ERROR_TM_IDENTITY_MISMATCH",
    "code": 6845,
    "msg": "The call to create a TransactionManager object failed because the Tm Identity stored in the logfile does not match the Tm Identity that was passed in as an argument."
  },
  {
    "title": "ERROR_FLOATED_SECTION",
    "code": 6846,
    "msg": "I/O was attempted on a section object that has been floated as a result of a transaction ending. There is no valid data."
  },
  {
    "title": "ERROR_CANNOT_ACCEPT_TRANSACTED_WORK",
    "code": 6847,
    "msg": "The transactional resource manager cannot currently accept transacted work due to a transient condition such as low resources."
  },
  {
    "title": "ERROR_CANNOT_ABORT_TRANSACTIONS",
    "code": 6848,
    "msg": "The transactional resource manager had too many tranactions outstanding that could not be aborted. The transactional resource manger has been shut down."
  },
  {
    "title": "ERROR_BAD_CLUSTERS",
    "code": 6849,
    "msg": "The operation could not be completed due to bad clusters on disk."
  },
  {
    "title": "ERROR_COMPRESSION_NOT_ALLOWED_IN_TRANSACTION",
    "code": 6850,
    "msg": "The compression operation could not be completed because a transaction is active on the file."
  },
  {
    "title": "ERROR_VOLUME_DIRTY",
    "code": 6851,
    "msg": "The operation could not be completed because the volume is dirty. Please run chkdsk and try again."
  },
  {
    "title": "ERROR_NO_LINK_TRACKING_IN_TRANSACTION",
    "code": 6852,
    "msg": "The link tracking operation could not be completed because a transaction is active."
  },
  {
    "title": "ERROR_OPERATION_NOT_SUPPORTED_IN_TRANSACTION",
    "code": 6853,
    "msg": "This operation cannot be performed in a transaction."
  },
  {
    "title": "ERROR_EXPIRED_HANDLE",
    "code": 6854,
    "msg": "The handle is no longer properly associated with its transaction. It may have been opened in a transactional resource manager that was subsequently forced to restart. Please close the handle and open a new one."
  },
  {
    "title": "ERROR_TRANSACTION_NOT_ENLISTED",
    "code": 6855,
    "msg": "The specified operation could not be performed because the resource manager is not enlisted in the transaction."
  },
  {
    "title": "ERROR_CTX_WINSTATION_NAME_INVALID",
    "code": 7001,
    "msg": "The specified session name is invalid."
  },
  {
    "title": "ERROR_CTX_INVALID_PD",
    "code": 7002,
    "msg": "The specified protocol driver is invalid."
  },
  {
    "title": "ERROR_CTX_PD_NOT_FOUND",
    "code": 7003,
    "msg": "The specified protocol driver was not found in the system path."
  },
  {
    "title": "ERROR_CTX_WD_NOT_FOUND",
    "code": 7004,
    "msg": "The specified terminal connection driver was not found in the system path."
  },
  {
    "title": "ERROR_CTX_CANNOT_MAKE_EVENTLOG_ENTRY",
    "code": 7005,
    "msg": "A registry key for event logging could not be created for this session."
  },
  {
    "title": "ERROR_CTX_SERVICE_NAME_COLLISION",
    "code": 7006,
    "msg": "A service with the same name already exists on the system."
  },
  {
    "title": "ERROR_CTX_CLOSE_PENDING",
    "code": 7007,
    "msg": "A close operation is pending on the session."
  },
  {
    "title": "ERROR_CTX_NO_OUTBUF",
    "code": 7008,
    "msg": "There are no free output buffers available."
  },
  {
    "title": "ERROR_CTX_MODEM_INF_NOT_FOUND",
    "code": 7009,
    "msg": "The MODEM.INF file was not found."
  },
  {
    "title": "ERROR_CTX_INVALID_MODEMNAME",
    "code": 7010,
    "msg": "The modem name was not found in MODEM.INF."
  },
  {
    "title": "ERROR_CTX_MODEM_RESPONSE_ERROR",
    "code": 7011,
    "msg": "The modem did not accept the command sent to it. Verify that the configured modem name matches the attached modem."
  },
  {
    "title": "ERROR_CTX_MODEM_RESPONSE_TIMEOUT",
    "code": 7012,
    "msg": "The modem did not respond to the command sent to it. Verify that the modem is properly cabled and powered on."
  },
  {
    "title": "ERROR_CTX_MODEM_RESPONSE_NO_CARRIER",
    "code": 7013,
    "msg": "Carrier detect has failed or carrier has been dropped due to disconnect."
  },
  {
    "title": "ERROR_CTX_MODEM_RESPONSE_NO_DIALTONE",
    "code": 7014,
    "msg": "Dial tone not detected within the required time. Verify that the phone cable is properly attached and functional."
  },
  {
    "title": "ERROR_CTX_MODEM_RESPONSE_BUSY",
    "code": 7015,
    "msg": "Busy signal detected at remote site on callback."
  },
  {
    "title": "ERROR_CTX_MODEM_RESPONSE_VOICE",
    "code": 7016,
    "msg": "Voice detected at remote site on callback."
  },
  {
    "title": "ERROR_CTX_TD_ERROR",
    "code": 7017,
    "msg": "Transport driver error."
  },
  {
    "title": "ERROR_CTX_WINSTATION_NOT_FOUND",
    "code": 7022,
    "msg": "The specified session cannot be found."
  },
  {
    "title": "ERROR_CTX_WINSTATION_ALREADY_EXISTS",
    "code": 7023,
    "msg": "The specified session name is already in use."
  },
  {
    "title": "ERROR_CTX_WINSTATION_BUSY",
    "code": 7024,
    "msg": "The task you are trying to do can&#39;t be completed because Remote Desktop Services is currently busy. Please try again in a few minutes. Other users should still be able to log on."
  },
  {
    "title": "ERROR_CTX_BAD_VIDEO_MODE",
    "code": 7025,
    "msg": "An attempt has been made to connect to a session whose video mode is not supported by the current client."
  },
  {
    "title": "ERROR_CTX_GRAPHICS_INVALID",
    "code": 7035,
    "msg": "The application attempted to enable DOS graphics mode. DOS graphics mode is not supported."
  },
  {
    "title": "ERROR_CTX_LOGON_DISABLED",
    "code": 7037,
    "msg": "Your interactive logon privilege has been disabled. Please contact your administrator."
  },
  {
    "title": "ERROR_CTX_NOT_CONSOLE",
    "code": 7038,
    "msg": "The requested operation can be performed only on the system console. This is most often the result of a driver or system DLL requiring direct console access."
  },
  {
    "title": "ERROR_CTX_CLIENT_QUERY_TIMEOUT",
    "code": 7040,
    "msg": "The client failed to respond to the server connect message."
  },
  {
    "title": "ERROR_CTX_CONSOLE_DISCONNECT",
    "code": 7041,
    "msg": "Disconnecting the console session is not supported."
  },
  {
    "title": "ERROR_CTX_CONSOLE_CONNECT",
    "code": 7042,
    "msg": "Reconnecting a disconnected session to the console is not supported."
  },
  {
    "title": "ERROR_CTX_SHADOW_DENIED",
    "code": 7044,
    "msg": "The request to control another session remotely was denied."
  },
  {
    "title": "ERROR_CTX_WINSTATION_ACCESS_DENIED",
    "code": 7045,
    "msg": "The requested session access is denied."
  },
  {
    "title": "ERROR_CTX_INVALID_WD",
    "code": 7049,
    "msg": "The specified terminal connection driver is invalid."
  },
  {
    "title": "ERROR_CTX_SHADOW_INVALID",
    "code": 7050,
    "msg": "The requested session cannot be controlled remotely. This may be because the session is disconnected or does not currently have a user logged on."
  },
  {
    "title": "ERROR_CTX_SHADOW_DISABLED",
    "code": 7051,
    "msg": "The requested session is not configured to allow remote control."
  },
  {
    "title": "ERROR_CTX_CLIENT_LICENSE_IN_USE",
    "code": 7052,
    "msg": "Your request to connect to this Terminal Server has been rejected. Your Terminal Server client license number is currently being used by another user. Please call your system administrator to obtain a unique license number."
  },
  {
    "title": "ERROR_CTX_CLIENT_LICENSE_NOT_SET",
    "code": 7053,
    "msg": "Your request to connect to this Terminal Server has been rejected. Your Terminal Server client license number has not been entered for this copy of the Terminal Server client. Please contact your system administrator."
  },
  {
    "title": "ERROR_CTX_LICENSE_NOT_AVAILABLE",
    "code": 7054,
    "msg": "The number of connections to this computer is limited and all connections are in use right now. Try connecting later or contact your system administrator."
  },
  {
    "title": "ERROR_CTX_LICENSE_CLIENT_INVALID",
    "code": 7055,
    "msg": "The client you are using is not licensed to use this system. Your logon request is denied."
  },
  {
    "title": "ERROR_CTX_LICENSE_EXPIRED",
    "code": 7056,
    "msg": "The system license has expired. Your logon request is denied."
  },
  {
    "title": "ERROR_CTX_SHADOW_NOT_RUNNING",
    "code": 7057,
    "msg": "Remote control could not be terminated because the specified session is not currently being remotely controlled."
  },
  {
    "title": "ERROR_CTX_SHADOW_ENDED_BY_MODE_CHANGE",
    "code": 7058,
    "msg": "The remote control of the console was terminated because the display mode was changed. Changing the display mode in a remote control session is not supported."
  },
  {
    "title": "ERROR_ACTIVATION_COUNT_EXCEEDED",
    "code": 7059,
    "msg": "Activation has already been reset the maximum number of times for this installation. Your activation timer will not be cleared."
  },
  {
    "title": "ERROR_CTX_WINSTATIONS_DISABLED",
    "code": 7060,
    "msg": "Remote logins are currently disabled."
  },
  {
    "title": "ERROR_CTX_ENCRYPTION_LEVEL_REQUIRED",
    "code": 7061,
    "msg": "You do not have the proper encryption level to access this Session."
  },
  {
    "title": "ERROR_CTX_SESSION_IN_USE",
    "code": 7062,
    "msg": "The user %s\\\\%s is currently logged on to this computer. Only the current user or an administrator can log on to this computer."
  },
  {
    "title": "ERROR_CTX_NO_FORCE_LOGOFF",
    "code": 7063,
    "msg": "The user %s\\\\%s is already logged on to the console of this computer. You do not have permission to log in at this time. To resolve this issue, contact %s\\\\%s and have them log off."
  },
  {
    "title": "ERROR_CTX_ACCOUNT_RESTRICTION",
    "code": 7064,
    "msg": "Unable to log you on because of an account restriction."
  },
  {
    "title": "ERROR_RDP_PROTOCOL_ERROR",
    "code": 7065,
    "msg": "The RDP protocol component %2 detected an error in the protocol stream and has disconnected the client."
  },
  {
    "title": "ERROR_CTX_CDM_CONNECT",
    "code": 7066,
    "msg": "The Client Drive Mapping Service Has Connected on Terminal Connection."
  },
  {
    "title": "ERROR_CTX_CDM_DISCONNECT",
    "code": 7067,
    "msg": "The Client Drive Mapping Service Has Disconnected on Terminal Connection."
  },
  {
    "title": "ERROR_CTX_SECURITY_LAYER_ERROR",
    "code": 7068,
    "msg": "The Terminal Server security layer detected an error in the protocol stream and has disconnected the client."
  },
  {
    "title": "ERROR_TS_INCOMPATIBLE_SESSIONS",
    "code": 7069,
    "msg": "The target session is incompatible with the current session."
  },
  {
    "title": "ERROR_TS_VIDEO_SUBSYSTEM_ERROR",
    "code": 7070,
    "msg": "Windows can&#39;t connect to your session because a problem occurred in the Windows video subsystem. Try connecting again later, or contact the server administrator for assistance."
  },
  {
    "title": "FRS_ERR_INVALID_API_SEQUENCE",
    "code": 8001,
    "msg": "The file replication service API was called incorrectly."
  },
  {
    "title": "FRS_ERR_STARTING_SERVICE",
    "code": 8002,
    "msg": "The file replication service cannot be started."
  },
  {
    "title": "FRS_ERR_STOPPING_SERVICE",
    "code": 8003,
    "msg": "The file replication service cannot be stopped."
  },
  {
    "title": "FRS_ERR_INTERNAL_API",
    "code": 8004,
    "msg": "The file replication service API terminated the request. The event log may have more information."
  },
  {
    "title": "FRS_ERR_INTERNAL",
    "code": 8005,
    "msg": "The file replication service terminated the request. The event log may have more information."
  },
  {
    "title": "FRS_ERR_SERVICE_COMM",
    "code": 8006,
    "msg": "The file replication service cannot be contacted. The event log may have more information."
  },
  {
    "title": "FRS_ERR_INSUFFICIENT_PRIV",
    "code": 8007,
    "msg": "The file replication service cannot satisfy the request because the user has insufficient privileges. The event log may have more information."
  },
  {
    "title": "FRS_ERR_AUTHENTICATION",
    "code": 8008,
    "msg": "The file replication service cannot satisfy the request because authenticated RPC is not available. The event log may have more information."
  },
  {
    "title": "FRS_ERR_PARENT_INSUFFICIENT_PRIV",
    "code": 8009,
    "msg": "The file replication service cannot satisfy the request because the user has insufficient privileges on the domain controller. The event log may have more information."
  },
  {
    "title": "FRS_ERR_PARENT_AUTHENTICATION",
    "code": 8010,
    "msg": "The file replication service cannot satisfy the request because authenticated RPC is not available on the domain controller. The event log may have more information."
  },
  {
    "title": "FRS_ERR_CHILD_TO_PARENT_COMM",
    "code": 8011,
    "msg": "The file replication service cannot communicate with the file replication service on the domain controller. The event log may have more information."
  },
  {
    "title": "FRS_ERR_PARENT_TO_CHILD_COMM",
    "code": 8012,
    "msg": "The file replication service on the domain controller cannot communicate with the file replication service on this computer. The event log may have more information."
  },
  {
    "title": "FRS_ERR_SYSVOL_POPULATE",
    "code": 8013,
    "msg": "The file replication service cannot populate the system volume because of an internal error. The event log may have more information."
  },
  {
    "title": "FRS_ERR_SYSVOL_POPULATE_TIMEOUT",
    "code": 8014,
    "msg": "The file replication service cannot populate the system volume because of an internal timeout. The event log may have more information."
  },
  {
    "title": "FRS_ERR_SYSVOL_IS_BUSY",
    "code": 8015,
    "msg": "The file replication service cannot process the request. The system volume is busy with a previous request."
  },
  {
    "title": "FRS_ERR_SYSVOL_DEMOTE",
    "code": 8016,
    "msg": "The file replication service cannot stop replicating the system volume because of an internal error. The event log may have more information."
  },
  {
    "title": "FRS_ERR_INVALID_SERVICE_PARAMETER",
    "code": 8017,
    "msg": "The file replication service detected an invalid parameter."
  }
]
